from django.http import FileResponse
from openpyxl import load_workbook
from datetime import datetime
import io

def generate_report(request):
    # Путь к файлу и название листа
    file_path = 'out_doc.xlsx'
    sheet_name = 'Лист1'

    # Загрузка существующей книги и листа
    workbook = load_workbook(file_path)
    sheet = workbook[sheet_name]

    # Пример данных для добавления
    data = [
    [
        "Иванов И.И.", "Кафедра математики", "Доктор наук", "Профессор", "Заведующий кафедрой", 1.0, "Основной", 50, 40, 30, 20, 10, 5, 0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200, 210, 170, 180, 190, 200, 210
    ],
    [
        "Петров П.П.", "Кафедра физики", "Кандидат наук", "Доцент", "Преподаватель", 0.75, "Основной", 40, 30, 20, 15, 10, 5, 0, 10, 20, 25, 35, 45, 55, 65, 75, 85, 95, 105, 115, 125, 135, 145, 155, 165, 175, 185, 195, 205, 170, 180, 190, 200, 210
    ],
    [
        "Сидорова Е.Е.", "Кафедра химии", "Без степени", "Ассистент", "Ассистент", 0.5, "Совместитель", 30, 20, 10, 5, 0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100, 105, 110, 115, 170, 180, 190, 200, 210
    ],
    [
        "Кузнецов А.А.", "Кафедра информатики", "Доктор наук", "Профессор", "Заведующий кафедрой", 1.0, "Основной", 60, 50, 40, 30, 20, 10, 5, 15, 25, 35, 45, 55, 65, 75, 85, 95, 105, 115, 125, 135, 145, 155, 165, 175, 185, 195, 205, 215, 170, 180, 190, 200, 210
    ],
    [
        "Николаева О.О.", "Кафедра биологии", "Кандидат наук", "Доцент", "Преподаватель", 0.75, "Совместитель", 35, 25, 15, 10, 5, 10, 15, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200, 210, 220, 170, 180, 190, 200, 210
    ]
]

    # Добавляем данные
    last_row = 7
    for entry in data:
        last_row += 1
        for col, value in enumerate(entry, start=1):
            sheet.cell(row=last_row, column=col).value = value

    # Формируем имя файла с датой
    current_date = datetime.now()
    formatted_date = current_date.strftime("%Y-%m-%d_%H-%M-%S")
    
    # Сохраняем в BytesIO вместо физического файла
    output = io.BytesIO()
    workbook.save(output)
    output.seek(0)  # Перемещаем курсор в начало потока

    # Отправляем файл на скачивание
    response = FileResponse(output, as_attachment=True, filename=f"Отчет_{formatted_date}.xlsx")

    return response
